<a href="https://colab.research.google.com/github/manju1983/DataScience/blob/main/Titanic_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
test = ('https://github.com/manju1983/DataScience/blob/main/test.csv')

In [2]:
import pandas as pd

In [5]:
test

'https://github.com/manju1983/DataScience/blob/main/test.csv'

In [6]:
test = pd.read_csv('https://raw.githubusercontent.com/manju1983/DataScience/main/test.csv')

In [8]:
test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [10]:
train = pd.read_csv('https://raw.githubusercontent.com/manju1983/DataScience/main/train.csv')

In [11]:
train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]